---
kind: method
id: M:Autodesk.Revit.DB.Blend.GetVertexConnectionMap
source: html/13e548d2-4824-d3cb-4d32-dfffb4f503c3.htm
---
# Autodesk.Revit.DB.Blend.GetVertexConnectionMap Method

Gets the mapping between the vertices in the top and bottom profiles.

## Syntax (C#)
```csharp
public VertexIndexPairArray GetVertexConnectionMap()
```

## Remarks
Each vertex refers to the start point of the curve from the top and bottom profiles.